# vsoWidgetPopupGetTxt

## Description
For an OIP search popup widget, returns the text of an item specified by it's id.

```pascal
FUNCTION vsoWidgetPopupGetTxt(
				widgetID : LONGINT;
				id       : STRING): STRING;
```

```python
def vs.vsoWidgetPopupGetTxt(widgetID, id):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT|   |
|id|STRING|   |

## Version
Availability: from Vectorworks 2020

## Category
* Object Events